### Importing required libraries.

In [2]:
import csv
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import sqlite3

### Establishing connection to the accident database.

In [3]:
con = sqlite3.connect("accident_data_v1.0.0_2023.db")

In [4]:
# Creating a variable that would allow the successful executions of SQL queries.
cur = con.cursor()

### Retrieving information about the database tables.

In [4]:
cur.execute("""
SELECT name
FRom sqlite_master
WHERE type = "table"
""")
table_names = cur.fetchall()
print(f"The name of the tables in accident database are:")
for i in table_names:
    print(i[0])

The name of the tables in accident database are:
accident
casualty
vehicle
lsoa

## Answers to Question 3

### 3a) The age of the oldest driver/rider in the casualty table

In [5]:
cur.execute("""
SELECT MAX (age_of_casualty)
FROM casualty
WHERE casualty_class = 1
""")
oldest = cur.fetchone()
print(f"The age of the oldest driver/rider in the casualty table is {oldest[0]}.")

The age of the oldest driver/rider in the casualty table is 101.

### 3b) The total number of vehicle_type = 19 vehicles in the vehicle table

In [6]:
cur.execute("""
SELECT COUNT (vehicle_type)
FROM vehicle
WHERE vehicle_type = 19
""")
vehicle_19 = cur.fetchone()
print(f"The total number of vehicle_type = 19 vehicles in the vehicle table is {vehicle_19[0]}.")

The total number of vehicle_type = 19 vehicles in the vehicle table is 47458.

### 3c) The sex of driver, sex of casualty, speed limit and age of vehicle for accidents in all the lower layer super output area (LSOA) regions of Kingston Upon Hull.

In [7]:
cur.execute("""
SELECT v.sex_of_driver, c.sex_of_casualty, a.speed_limit, v.age_of_vehicle
FROM accident as a
INNER JOIN vehicle as v ON a.accident_index = v.accident_index
INNER JOIN casualty as c ON a.accident_index = c.accident_index
INNER JOIN lsoa as l ON a.lsoa_of_accident_location = l.lsoa01cd
WHERE lsoa01nm LIKE "%Kingston upon Hull%"

""")

res = cur.fetchall()

In [8]:
# Creating a list that contains the name of the dataseries (columns) and assigning a variable to the list.
col = ["sex_of_driver", "sex_of_casualty", "speed_limit", "age_of_vehicle"]

In [9]:
# Creating a dataframe from the result set of the SQL query that was executed above.
extracted_df = pd.DataFrame(res, columns = col)
extracted_df

      sex_of_driver  sex_of_casualty  speed_limit  age_of_vehicle
0                 1                1           30              13
1                 1                1           30               9
2                 3                1           30               6
3                 3                2           30               6
4                 1                1           30              11
...             ...              ...          ...             ...
6382              1                1           30              -1
6383              1                1           30              -1
6384              1                1           30              -1
6385              3                1           30              -1
6386              1                1           30              -1

[6387 rows x 4 columns]

In [10]:
# Creating a copy of the extracted_df dataframe.
extracted_df2 = pd.DataFrame(extracted_df)
# Replacing the numerical codes indicated in the columns of sex_of_driver and sex_of_casualty to their corresponding denotations.
extracted_df2[["sex_of_driver","sex_of_casualty"]] = extracted_df2[["sex_of_driver","sex_of_casualty"]].replace({1 : "Male", 2 : "Female", 3: "Not Known"})
extracted_df2

     sex_of_driver sex_of_casualty  speed_limit  age_of_vehicle
0             Male            Male           30              13
1             Male            Male           30               9
2        Not Known            Male           30               6
3        Not Known          Female           30               6
4             Male            Male           30              11
...            ...             ...          ...             ...
6382          Male            Male           30              -1
6383          Male            Male           30              -1
6384          Male            Male           30              -1
6385     Not Known            Male           30              -1
6386          Male            Male           30              -1

[6387 rows x 4 columns]